lcyz-server/spec/fixtures/stock_out_inventories.yml

# == Schema Information
#
# Table name: stock_out_inventories # 出库清单
#
#  id                             :integer          not null, primary key # 出库清单
#  car_id                         :integer                                # 所属车辆
#  stock_out_inventory_type       :string                                 # 出库类型
#  completed_at                   :date                                   # 成交日期
#  seller_id                      :integer                                # 成交员工
#  customer_channel_id            :integer                                # 客户来源
#  closing_cost_cents             :integer                                # 成交价格
#  sales_type                     :string                                 # 销售类型
#  payment_type                   :string                                 # 付款类型
#  deposit_cents                  :integer                                # 定金
#  remaining_money_cents          :integer                                # 余款
#  transfer_fee_cents             :integer                                # 过户费用
#  commission_cents               :integer                                # 佣金
#  other_fee_cents                :integer                                # 其他费用
#  customer_location_province     :string                                 # 客户归属地省
#  customer_location_city         :string                                 # 客户归属地市
#  customer_location_address      :string                                 # 客户归属地地址
#  customer_name                  :string                                 # 客户姓名
#  customer_phone                 :string                                 # 联系电话
#  customer_idcard                :string                                 # 证件号
#  proxy_insurance                :boolean                                # 代办保险
#  insurance_company_id           :integer                                # 保险公司
#  commercial_insurance_fee_cents :integer                                # 商业险
#  compulsory_insurance_fee_cents :integer                                # 交强险
#  mortgage_company_id            :integer                                # 按揭公司
#  down_payment_cents             :integer                                # 首付款
#  loan_amount_cents              :integer                                # 贷款额度
#  mortgage_period_months         :integer                                # 按揭周期(月)
#  mortgage_fee_cents             :integer                                # 按揭费用
#  foregift_cents                 :integer                                # 押金
#  note                           :text                                   # 备注
#  refunded_at                    :date                                   # 退车日期
#  refund_price_cents             :integer                                # 退回车价
#  driven_back_at                 :datetime                               # 车主开回时间
#  returned_at                    :datetime                               # 车主归还时间
#  current                        :boolean                                # 是否是当前库存状态的清单
#  created_at                     :datetime         not null
#  updated_at                     :datetime         not null
#  operator_id                    :integer
#  shop_id                        :integer                                # 分店ID
#  customer_id                    :integer                                # 客户ID
#  total_transfer_fee_cents       :integer                                # 过户总费用
#  carried_interest_cents         :integer                                # 提成金额
#  invoice_fee_cents              :integer                                # 发票费用
#

inventory: &inventory
  car: aodi
  stock_out_inventory_type: sold
  completed_at: 2015-04-20
  seller: zhangsan
  customer_channel: individual
  closing_cost_cents: 20_000_000
  sales_type: retail

  customer_location_province: 浙江省
  customer_location_city: 杭州
  customer_location_address: 创意园
  customer_name: 机器猫
  customer_phone: 100
  customer_idcard: 123456
  proxy_insurance: true
  insurance_company: pingan.id
  commercial_insurance_fee_cents: 40_000
  compulsory_insurance_fee_cents: 50_000
  invoice_fee_cents: 10_000
  note: abc
  created_at: <%= Time.zone.parse("2015-01-10").utc.to_s(:db) %>

aodi_cash: # 现金方式
  <<: *inventory

  payment_type: cash
  deposit_cents: 5_000_000
  remaining_money_cents: 15_000_000
  transfer_fee_cents: 40_000
  commission_cents: 500_000
  other_fee_cents: 40_000
  current: true

mortgage: # 贷款方式
  <<: *inventory

  payment_type: mortgage
  mortgage_company: cmb_china
  down_payment_cents: 5_000_000
  loan_amount_cents: 30_000_000
  mortgage_period_months: 12
  mortgage_fee_cents: 600_000
  foregift_cents: 500_000
  transfer_fee_cents: 40_000
  commission_cents: 500_000
  other_fee_cents: 40_000

tumbler_cash:
  <<: *inventory

  car: tumbler
  payment_type: cash
  deposit_cents: 5_000_000
  remaining_money_cents: 15_000_000
  transfer_fee_cents: 40_000
  commission_cents: 500_000
  other_fee_cents: 40_000
  current: true

aodi_sold_cash:
  <<: *inventory

  car: aodi_sold
  payment_type: cash
  closing_cost_cents: 30_000_000
  deposit_cents: 5_000_000
  remaining_money_cents: 25_000_000
